Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The code to be called must be available as a shared library. Most C and Fortran libraries ship compiled as shared libraries already, but if you are compiling the code yourself using GCC (or Clang), you will need to use the -shared and -fPIC options. The machine instructions generated by Julia's JIT are the same as a native C call would be, so the resulting overhead is the same as calling a library function from C code. (Non-library function calls in both C and Julia can be inlined and thus may have even less overhead than calls to shared library functions. When both libraries and executables are generated by LLVM, it is possible to perform whole-program optimizations that can even optimize across this boundary, but Julia does not yet support that. In the future, however, it may do so, yielding even greater performance gains.)
ja: 呼び出されるコードは共有ライブラリとして使用可能である必要があります。ほとんどのCおよびFortranライブラリは、次のようになります。 はすでに共有ライブラリとしてコンパイルされていますが、GCCを使用して自分でコードをコンパイルする場合は Clang)は、-共有および-fPICオプションを使用する必要があります。 JuliaのJITはネイティブのC呼び出しと同じであるため、結果として生じるオーバーヘッドは同じです。 Cコードからライブラリ関数を呼び出します(CとJuliaの両方での非ライブラリ関数呼び出しです)。 共有ライブラリ関数への呼び出しよりも、インライン化されるため、オーバーヘッドが少なくなります。両方とも ライブラリと実行可能ファイルはLLVMによって生成されるため、プログラム全体の最適化を実行することができます。 この境界を越えて最適化することもできますがジュリアはまだサポートしていません将来は しかし、それによってパフォーマンスが向上する可能性があります。

source: The compiler will use it if convenient, but otherwise may choose to use the normal implementation instead.
ja: コンパイラは、便利であればそれを使用しますが、そうでなければ通常のものを使用することを選択することができます。 代わりに実装する必要があります。

source: The complete list of trigonometric functions with degree variants is:
ja: 角度で計算できる三角関数のリストは以下の通りです。:

source: The concatenation functions are used so often that they have special syntax:
ja: 連結関数は、頻繁に使用されるため、特別な構文が使用されます。

source: The condition expressions in the if-elseif-else construct are evaluated until the first one evaluates to true, after which the associated block is evaluated, and no further condition expressions or blocks are evaluated.
ja: if-elseif-else構文中の条件文は、真になるものが現れるまで評価が続きます。 その真になった条件式に対応するブロックが評価されると、あとの条件式やブロックは評価されません。

source: The contents and code at the cfunction pointer will be erased via a `finalizer`
ja: cfunctionポインタでの内容とコードは、`ファイナライザー''によって消去されます。

source: The core language imposes very little; Julia Base and the standard library is written in Julia itself, including primitive operations like integer arithmetic
ja: 言語のコア部分は最小限の機能しか提供しません。整数の四則演算のような初等演算を含む標準ライブラリはJulia自身で書かれています

source: The core language imposes very little; the standard library is written in Julia itself, including primitive operations like integer arithmetic
ja: 言語のコア部分は最小限の機能しか提供しません。整数の四則演算のような初等演算を含む標準ライブラリはJulia自身で書かれています

source: The default @.
ja: デフォルトの@,

source: The default constructor is equivalent to writing your own inner constructor method that takes all of the object's fields as parameters (constrained to be of the correct type, if the corresponding field has a type), and passes them to new, returning the resulting object:
ja: デフォルトのコンストラクタ は、すべてのオブジェクトのフィールドを取得する独自のインナー・コンストラクタ・メソッドを記述することと同じです。 パラメータとして指定します(対応するフィールドが型を持つ場合は、正しいタイプに制限されます)。 そして、それらを新しいに渡して、結果として得られるオブジェクトを返します。

source: The default mode used is always RoundNearest, which rounds to the nearest representable value, with ties rounded towards the nearest value with an even least significant bit.
ja: 使用されるデフォルト・モードは常にRoundNearestであり、これは最も近い表現可能なものに丸められます。 値は、最も近い値に対して、最も近い値に丸められ、最も重要なビットであることを示します。

source: The default mode used is always `RoundNearest`, which rounds to the nearest representable value, with ties rounded towards the nearest value with an even least significant bit.
ja: デフォルトでは、偶数の最下位ビットに最も近い値になるよう値を 繰り上げる `RoundNearest`,が常に使用されます。

source: The default precision (in number of bits of the significand) and rounding mode of `BigFloat`
ja: デフォルトの精度（仮数のビット数で設定）および`BigFloat`関数の端数処理は

source: The default sorting algorithms are chosen on the basis that they are fast and stable, or appear
ja: デフォルトのソートアルゴリズムは、高速で安定しているか、がであることに基づいて選択されます。

source: The default type for an integer literal depends on whether the target system has a 32-bit architecture or a 64-bit architecture:
ja: 整数リテラルのデフォルトの型は、ターゲットシステムのアーキテクチャが32ビットであるか 64ビットであるかによって異なります。:

source: The definitive guide to floating point arithmetic is the IEEE 754-2008 Standard; however, it is not available for free online.
ja: 浮動小数点演算の最終的なガイドは、IEEE754-2008標準です。 ただし、無料のオンラインでは利用できません。

source: The dependency graph of a project directory is determined by the presence and contents of project files in the subdirectory of each package.
ja: プロジェクトディレクトリの依存グラフは、各パッケージのサブディレクトリ内にあるプロジェクトファイルの存在と内容によって決まります。

source: The dependency graph of a project environment is determined by the contents of the manifest file, if present.
ja: プロジェクト環境の依存グラフは、マニフェストファイルが存在する場合は、その内容によって決定されます。

source: The destructuring feature can also be used within a function argument.
ja: デストラクチャリング機能は、関数引数内で使用することもできます。

source: The display functions for D can then be called directly, but they can also be invoked automatically from `display(x)` simply by pushing a new display onto the display-backend stack with:
ja: Dの表示関数は直接呼び出すことができますが、呼び出されることもあります。 display(x)`display(x)`単に新しいディスプレイをディスプレイのバックエンド・スタックにプッシュすることによって、自動的に`display(x)`から :

source: The distance between two adjacent representable floating-point numbers is not constant, but is smaller for smaller values and larger for larger values.
ja: 隣接する2つの浮動小数点数の距離は一定ではありませんが、小さい値ではその距離はより小さく、 大きい値ではより大きくなります。言

source: The easiest way to learn and experiment with Julia is by starting an interactive session (also known as a read-eval-print loop or “repl”) by double-clicking the Julia executable or running julia from the command line:
ja: Juliaを学んだり試したりする一番簡単な方法は、インタラクティブ・セッション（read-eval-print loop、もしくは”repl”とも呼ばれるものです）を使ったものです。セッションを起動するには、Juliaの実行ファイルをダブルクリックするか、コマンドラインからjulia を実行します。

source: The easiest way to learn and experiment with Julia is by starting an interactive session (also known as a read-eval-print loop or "REPL") by double-clicking the Julia executable or running julia from the command line:
ja: Juliaを学んだり試したりする一番簡単な方法は、インタラクティブ・セッション（read-eval-print loop、もしくは”repl”とも呼ばれるものです）を使ったものです。セッションを起動するには、Juliaの実行ファイルをダブルクリックするか、コマンドラインからjuliaを実行します。

source: The easiest way to learn and experiment with Julia is by starting an interactive session (also known as a read-eval-print loop or "repl") by double-clicking the Julia executable or running julia from the command line:
ja: Juliaを学んだり試したりする一番簡単な方法は、インタラクティブ・セッション（read-eval-print loop、もしくは”repl”とも呼ばれるものです）を使ったものです。セッションを起動するには、Juliaの実行ファイルをダブルクリックするか、コマンドラインからjuliaを実行します。

source: The easiest way to understand this behavior is to see an example.
ja: この動作を理解する最も簡単な方法は、例を見ることでしょう。

source: The effect of import X depends on two questions:
ja: インポートXの効果は、次の2つの質問に依存しています。

source: The element type of the tuple must be an instance of VecElement{T} where T is a primitive type that is 1, 2, 4 or 8 bytes.
ja: タプルの要素タイプは、VecElement{T}のインスタンスでなければならない。ここで、Tはプリミティブ型である。 は、1 2 4バイトまたは8バイトです。

source: The expression a, before the ?, is a condition expression, and the ternary operation evaluates the expression b, before the :, if the condition a is true or the expression c, after the :, if it is false.
ja: ！の前にある式aは条件式で、三項演算はaが真のときは、:の前にあるbを評価し、偽の時は、:の後にあるcを評価します。

source: The expression include("source.jl") causes the contents of the file source.jl to be evaluated in the global scope of the module where the include call occurs.
ja: の表現は、がのコールが発生するモジュールのグローバルスコープで、ファイルソース.jlの内容を評価することを意味します。は、の内容を表します。

source: The fallback definition is
ja: フォールバック定義は、次のとおりです。

source: The field declarations num::T
ja: フィールド宣言num::T

source: The final argument bc is a lazy representation of a (potentially fused) broadcast operation, a Broadcasted
ja: 最後の引数 bcは(潜在的に融合された)ブロードキャスト動作の遅延表現であり、ブロードキャストされたである。

source: The final call to qsort looks like this:
ja: qsortの最終的な呼び出しは、次のようになります。

source: The final problem which has still not been addressed is construction of self-referential objects, or more generally, recursive data structures.
ja: まだ取り組まれていない最後の問題は、自己参照オブジェクトの構築です。 より一般的には、再帰データ構造体です。

source: The first and most basic definition just makes a ⊘ b construct a OurRational by applying the OurRational constructor to a and b when they are integers.
ja: 最初と最も基本的な定義は、aθb構成を作成することによって、OurRational<x/>を構成することができます。 OurRationalコンストラクタとbは整数である。

source: The first argument to `@cfunction` can be marked with a $, in which case the return value will instead be a struct CFunction which closes over the argument.
ja: `@cfunction`の最初の引数は、$でマークすることができます。この場合は 戻り値は、引数の上で閉じる構造体CFunctionとなります。

source: The first argument to `ccall` can also be an expression evaluated at run time.
ja: `ccall'への最初の引数は、実行時に評価された式でもあります。

source: The first construct is used when you need the value, but not index, of each element.
ja: 最初の構成は、各要素の値が必要な場合に使用されますが、インデックスでは使用されません。

source: The first construct is used when you need the value, but not index, of each element. In the second construct, i will be an Int if A is an array type with fast linear indexing; otherwise, it will be a CartesianIndex:
ja: 最初の構成は、各要素の値が必要な場合に使用されますが、インデックスではありません。2番目の構成は、次のように使用されます。 構成,iはIntであり,Aが高速線形インデックスを用いたアレイ型である場合は,それ以外の値である。 CartesianIndexになります。

source: The first five control flow mechanisms are standard to high-level programming languages.
ja: はじめの５つは、高水準なプログラミング言語には標準的な制御構造です。

source: The first form creates a `Symbol`, an interned string used as one building-block of expressions:
ja: 最初の形式では、`Symbol'が作成されます。 インターンされたストリングは、1つのビルディング・ブロックとして使用されます。 式:

source: The first index
ja: 最初のインデックス

source: The first is the "standard" general constructor that infers the type parameter T from the type of the numerator and denominator when they have the same type.
ja: 一つ目は「標準」です 分子の種類と分母のタイプからの型パラメータTを推論する一般的なコンストラクタ 同じタイプを持っています。

source: The first line -- struct OurRational{T<:Integer} <: Real -- declares that OurRational takes one type parameter of an integer type, and is itself a real type.
ja: 最初の行--struct OurRational{T<:Integer}<:Real--は、OurRational<x/>を宣言します。 integer型のパラメータで、それ自体が実際の型です。

source: The first method applies whenever both arguments are of the same concrete type, regardless of what type that is, while the second method acts as a catch-all, covering all other cases.
ja: 第1のメソッドは、両方の引数が同じ具象型であれば、どんな型であれ適用されます。第2のメソッドは他のすべての場合に渡る全捕捉として働きます。

source: The first method definition for a function creates the function object, and subsequent method definitions add new methods to the existing function object.
ja: 最初のメソッド定義では、関数オブジェクトを作成され、次回以降のメソッド定義では、既存の関数オブジェクトに新しいメソッドが追加されます。

source: The floating-point literal expression 1e10 could be interpreted as the numeric literal 1 multiplied by the variable e10, and similarly with the equivalent E form.
ja: 浮動小数点リテラルの表記 1e10 は、数値リテラル 1 掛ける指数関数のような変数 e10 と解釈される可能性があります

source: The following change to the above function results in a runtime error
ja: 次 上記の関数に変更すると、ランタイムエラーになります。

source: The following arithmetic operators
ja: 以下の演算子演算子

source: The following bitwise operators
ja: 以下のビット演算子

source: The following Julia code calls dist using ccall:
ja: 次のJuliaコードは、ccallを使用してdistを呼び出します。

source: The following are Julia's primitive numeric types:
ja: 以下はJuliaにおける数値プリミティブ型です。

source: The following arguments, if any, are the actual argument values passed to the function.
ja: 次の引数は、関数に渡された実際の引数の値です。

source: The following example computes a dot product using a BLAS function.
ja: 次の例では、BLAS関数を使用してドット製品を計算します。

source: The following example computes a weighted average of the current element and its left and right neighbor along a 1-d grid.
ja: 次の例では、現在の要素とその左側と右側の加重平均を計算しています。 1Dグリッドに沿った隣接。

source: The following example computes a weighted average of the current element and its left and right neighbor along a 1-d grid. :
ja: 次の例では、現在の要素とその左側と右側の加重平均を計算しています。 1Dグリッドに沿った隣接するもの:

source: The following example computes the QR decomposition of a small section of a larger array, without creating any temporaries, and by calling the appropriate LAPACK function with the right leading dimension size and stride parameters.
ja: 次の例は、大きな配列の小さいセクションのQR分解を計算します。 一時的なものを作成すること、そして適切なLAPACK関数を使って適切な関数を呼び出すこと 寸法のサイズと歩幅のパラメータです。

source: The following examples show the different forms.
ja: 以下の例は異なる形式を表しています。

source: The following is an inefficient and verbose way to iterate through the characters of s:
ja: 下の例は sという文字を反復処理する非効率的で冗長的な方法です。:

source: The following methods and types in Base.StackTraces are not exported and need to be called e.g. as StackTraces.lookup(ptr).
ja: ベース.StackTracesでは、次のメソッドとタイプはエクスポートされず、呼び出される必要があります。 StackTraces.lookup(ptr)となります。

source: The following methods are described as "unsafe" because a bad pointer or type declaration can cause Julia to terminate abruptly.
ja: 次のメソッドは、不正なポインタまたはタイプ宣言は、「安全でない」と記述されています。 ジュリアが突然終了する原因です。

source: The following operators are supported for arrays:
ja: 配列では、次の演算子がサポートされています。

source: The following two types are equivalent -- one with a default constructor, the other with an explicit constructor:
ja: 次の2つのタイプは、デフォルトコンストラクタを使用した場合と同じです。 もう一つは明示的なコンストラクタである。

source: The following two-word sequences are reserved: abstract type, mutable struct, primitive type.
ja: 次の2語のシーケンスが予約されています。 抽象型,mutable構造体,プリミティブ型。

source: The former is a single character value of type Char, while the latter is a string value that happens to contain only a single character.
ja: 前者の記法では一文字のみを取得することが想定されているので、前者は Char型になります。

source: The full dependency graph of the first environment in a stack is guaranteed to be included intact in the stacked environment including the same versions of all dependencies.
ja: スタック内の最初の環境の完全な依存性グラフは、すべての依存関係の同じバージョンを含むスタック環境で完全に含まれていることが保証されています。

source: The full gamut of other Elementary Functions
ja: その他のプリミティブ関数の全範囲

source: The garbage collector does not guarantee any order of finalization.
ja: ガーベジ・コレクターは、最終化の順序を保証しません。

source: The general for loop:
ja: ループの一般的なは次のようになります。

source: The general syntax for assigning values in an n-dimensional array A is:
ja: n次元配列Aの値を代入する一般的な構文は次のとおりです。

source: The general syntax for indexing into an n-dimensional array A is:
ja: n次元配列Aへの索引付けの一般的な構文は次のとおりです。

source: The global constant `im` is bound to the complex number i, representing the principal square root of -1.
ja: グローバル定数`im'は、複素数iに結合されており、これは主なものである。 -1の平方根です。

source: The hexadecimal integer literal expression 0xff could be interpreted as the numeric literal 0 multiplied by the variable xff.
ja: 16進整数リテラルの表記 0xff は、数値リテラル 0 掛ける変数 xff と解釈される可能性があります。

source: The host machine must have the requisite SIMD registers.
ja: ホストマシンは、必要なSIMDレジスタを持っている必要があります。

source: The identity element of this set is the empty string, "".
ja: この集合の単位元は空の文字列 "".です。

source: The implementation of a mathematical operator generally depends on the types of all of its arguments.
ja: 数学的演算子の実装は、一般には、すべての引数の型に依存しています。

source: The implementation of this behavior is a "world age counter".
ja: この行動の実装は「世界の世代のカウンター」です。

source: The import mechanism allows you to load a package—i.e. an independent, reusable collection of Julia code, wrapped in a module—and makes the resulting module available by the name X inside of the importing module.
ja: インポート機構を使用すると、モジュールにラップされたJulia codeの独立した再利用可能なコレクションをロードできます。また、インポートモジュールの内部では、そのモジュールをx7/>xの名前で使用できるようになります。

source: The included path, source.jl, is interpreted relative to the file where the include call occurs.
ja: インクルードパスソース.jlは、がコールが発生するファイルに対して相対的に解釈されます。

source: The index argument is optional (default is 1), and follows the Julia-convention of 1-based indexing.
ja: index引数はオプションです(デフォルトです)。 は1)で、1ベースのインデックス作成のJulia条約に従っています。

source: The infix form is exactly equivalent to the function application form -- in fact the former is parsed to produce the function call internally.
ja: 中置方式は関数適用方式とまったく同等です。じつのところ、中置方式は構文解析後に、内部的に関数呼び出しを行っているのです。

source: The initial contents of a plain data type is undefined:
ja: プレーン・データ型の初期内容は、次のとおりです。 未定義:

source: The inner constructor method can then use the incomplete object, finishing its initialization before returning it.
ja: 内部コンストラクタメソッドは、不完全な オブジェクトは初期化を終了してから戻す。

source: The input n is passed by value, and so the function's input signature is simply declared as (Csize_t,) without any Ref or Ptr necessary.
ja: 入力nは値によって渡されるので、関数の入力シグネチャは次のようになります。 (Csize_t,)は、必要なRefPtrPtrを必要としません。

source: The input types must be written as a literal tuple, not a tuple-valued variable or expression.
ja: 入力タイプは、タプルではなく、リテラルタプルとして記述する必要があります。 変数または式。

source: The interested reader should consider perusing the rest of `rational.jl`: it is short, self-contained, and implements an entire basic Julia type.
ja: 興味のある読者は、残りの`rational.jl'の残りを熟考する必要があります。 は短い自己完結型で、基本的なJulia型を実装しています。

source: The intuition behind this behavior is that x is evaluated once for each $: one $ works similarly to eval(:x), giving x's value, while two $s do the equivalent of eval(eval(:x)).
ja: この挙動の背後にある直感は、xが、$に1回ずつ評価されることである。 $は、eval(:x)と同様に動作します。x10/>の値はxの値であり、2$x12/>です。 eval(eval(:x))に相当します。

source: The key point here is that Julia code is internally represented as a data structure that is accessible from the language itself.
ja: ここでのキーポイントは、Juliaコードは、アクセス可能なデータ構造として内部的に表現されるということです。

source: The lack of type declarations in most dynamic languages, however, means that one cannot instruct the compiler about the types of values, and often cannot explicitly talk about types at all.
ja: 多くの動的言語における型宣言の欠落は、コンパイラに対して値の型を伝えられない、または型について何ら触れることができないということを意味します。

source: The last error is because 'o' is a character literal, and `contains()` is a generic function that looks for subsequences.
ja: 最後のエラーは、'o'が文字リテラルであり、`contains()`は部分列を探す汎用関数であるために起こりました。

source: The last index, used in X[end]
ja: 最後のインデックスで、X[end]で使用されます。

source: The last point is potentially surprising and thus worth noting:
ja: 最後の記述は驚くべきものかもしれませんが、特段意味があるものではありません。

source: The location (i_1, i_2, i_3, ..., i_{n+1}) contains the value at A[I_1[i_1, i_2], I_2[i_3], ..., I_n[i_{n+1}]].
ja: 位置(i_1,i_2,i_3,.…i_{n+1})は、A[I_1[i_1,i_2],I_2[i_3],.…I_n[i_{n+1}]]の値を含む。

source: The location (i_1, i_2, i_3, ..., i_{n+1}) contains the value at A[I_1[i_1, i_2], I_2[i_3], ..., I_n[i_{n+1}]]. All dimensions indexed with scalars are dropped. For example, the result of A[2, I, 3] is an array with size size(I). Its ith element is populated by A[2, I[i], 3].
ja: 位置(i_1,i_2,i_3,.…i_{n+1})は、A[I_1[i_1,i_2],I_2[i_3],.…I_n[i_{n+1}]]の値を含む。 スカラーでインデックス付けされたすべての次元は削除されます。たとえば、A[2,I,3]の結果は sizeサイズ(I)の配列。ith要素はA[2,I[I],3]で占められる。

source: The machine instructions generated by Julia's JIT are the same as a native C call would be, so the resulting overhead is the same as calling a library function from C code.
ja: 生成されたマシン命令 JuliaのJITはネイティブのC呼び出しと同じであるため、結果として生じるオーバーヘッドは同じです。 は、Cコードからライブラリ関数を呼び出します。

source: The machines defined in file must be accessible via a passwordless ssh login, with Julia installed at the same location as the current host.
ja: file で定義されたマシンは、パスワード無しで ssh アクセスでき、現在のホストと同じ場所にJuliaがインストールされている必要があります。

source: The machines defined in file must be accessible via a password-less ssh login, with Julia installed at the same location as the current host.
ja: file で定義されたマシンは、パスワード無しで ssh アクセスでき、現在のホストと同じ場所にJuliaがインストールされている必要があります。

source: The macro `@cfunction` generates the C-compatible function pointer for a call to a Julia function.
ja: マクロ`@cfunction`は、コールのC互換関数ポインタを生成します。 Julia関数。

source: The macro `@cfunction` generates the C-compatible function pointer for a call to a Julia function. Arguments to `@cfunction` are as follows:
ja: マクロ`@cfunction`は、コールのC互換関数ポインタを生成します。 Julia関数。`@cfunction`への引数は次のとおりです。

source: The manifest file, if present, gives a complete dependency graph, including all direct and indirect dependencies, exact versions of each dependency, and sufficient information to locate and load the correct version.
ja: マニフェスト・ファイルが存在する場合、すべての依存関係、依存関係の正確なバージョン、適切なバージョンを検索してロードするための十分な情報など、すべての依存関係を含む完全な依存関係グラフが表示されます。

source: The matrix adds a dimension.
ja: マトリックスは寸法を追加します。

source: The meaning of X in import X is context-dependent: which X package is loaded depends on what code the statement occurs in.
ja: インポートXにおけるx10/>の意味はコンテキスト依存であり、Xパッケージは、文がどのコードによって生成されるかによって異なります。

source: The meaning of prefix & is not quite the same as in C. In particular, any changes to the referenced variables will not be visible in Julia unless the type is mutable (declared via mutable struct).
ja: プレフィックス&の意味は、Cとまったく同じではありません。特に、参照されているものの変更はありません。 変数は、そのタイプがmutable(mutable構造体によって宣言されている)でない限り、Juliaでは表示されません。

source: The meaning of this form is that F(x,y,...) is evaluated with the variables x, y, etc. taking on each value in their given list of values.
ja: この形式の意味は、F(x,y,...)は、変数x4、yの変数を用いて評価されることである。 指定された値リストの各値です。

source: The meaning of this form is that F(x,y,...) is evaluated with the variables x, y, etc. taking on each value in their given list of values. Values can be specified as any iterable object, but will commonly be ranges like 1:n or 2:(n-1), or explicit arrays of values like [1.2, 3.4, 5.7]. The result is an N-d dense array with dimensions that are the concatenation of the dimensions of the variable ranges rx, ry, etc. and each F(x,y,...) evaluation returns a scalar.
ja: この形式の意味は、F(x,y,...)は、変数x4、yの変数を用いて評価されることである。 指定された値リストの各値を指定します。値は、任意のオブジェクトとして指定することができますが は一般的に1:nまたは2:(n-1)、または[1.2、3.4、5.7]のような明示的な値の配列である。 結果は、次元の連結である次元を持つN次元の密配列です。 変数範囲rx、ryなど、各F(x,y,...)評価はスカラーを返します。

source: The mechanism by which Julia picks default sorting algorithms is implemented via the Base.Sort.defalg
ja: Juliaがデフォルトのソートアルゴリズムを選択するメカニズムは、Base.Sort.デフォルグを介して実装されます。

source: The mechanism for combining the roots, graph and paths data structures of the components of an environment stack is simple: they are simply merged as dictionaries, favoring earlier entries over later ones in the case of key collisions.
ja: 環境スタックの構成要素のルート,グラフとの各パスデータ構造を結合する機構は簡単である。

source: The memory is managed by Julia and the Ref signature alerts Julia's garbage collector to keep managing the memory for result_array while the `ccall` executes.
ja: メモリはJuliaによって管理され、Refのシグニチャアラートが表示されます。 のccallが実行されている間に、result_arrayのメモリを管理するためのガーベッジ・コレクタです。

source: The memory will be released the next time the garbage collector runs; you can force this to happen with (@ref Base.GC.gc).
ja: 次にガーベッジ・コレクターが実行されるとメモリーが解放され、次のように強制的に実行されます。 これは(@ref Base.GC.gc)で起こる。

source: The middle expression is only evaluated once, rather than twice as it would be if the expression were written as v(1) < v(2) && v(2) <= v(3).
ja: v(1) < v(2) && v(2) <= v(3)と記載されている場合は2度処理されるかのように 思われるかもしれませんが、中間の式は1度だけ処理されます。

source: The minimum and maximum representable values of primitive numeric types such as integers are given by the `typemin()` and `typemax()` functions:
ja: 整数のような数値プリミティブ型の最小値と最大値は、 `typemin()` および`typemax()`関数により取得が可能です。:

source: The minimum and maximum representable values of primitive numeric types such as integers are given by the `typemin` and `typemax` functions:
ja: 整数などのプリミティブ数値型の最小および最大表現可能値を指定します。 「テーパミン」および「テーペマス」関数:

source: The minimum and maximum representable values of primitive numeric types such as integers are given by the typemin and typemax functions:
ja: 整数などのプリミティブ数値型の最小および最大表現可能値を指定します。 typeminおよびtypemax関数:

source: The most significant departures of Julia from typical dynamic languages are:
ja: 一般の動的言語と比べてJuliaが特に優れている点としては以下のようなものが挙げられます。

source: The most specific method definition matching the number and types of the arguments will be executed when the function is applied.
ja: 関数の適用時に、引数の数と型が最も一致するメソッド定義が実行されます。

source: The new global is immediately visible to the tryeval function, so you could write return newfun (without parentheses).
ja: 新しいグローバルな関数はすぐにtryeval関数から見えるので、return newfun（カッコなし）と書くことができます。
